*** crates/idle-ipc/src/ffi_cell.rs:67:28: replace || with && in validate_grid_dims

*** mutation diff:
--- crates/idle-ipc/src/ffi_cell.rs
+++ replace || with && in validate_grid_dims
@@ -59,17 +59,17 @@
 
 pub const SHM_MAGIC: u32 = 0x54524e43;
 
 /// Reject zero, oversized, or overflowing grid dimensions before SHM allocate.
 pub fn validate_grid_dims(cols: usize, rows: usize) -> Result<(), &'static str> {
     if cols == 0 || rows == 0 {
         return Err("grid dimensions must be non-zero");
     }
-    if cols > MAX_GRID_DIM || rows > MAX_GRID_DIM {
+    if cols > MAX_GRID_DIM && /* ~ changed by cargo-mutants ~ */ rows > MAX_GRID_DIM {
         return Err("grid dimension exceeds maximum");
     }
     match cols.checked_mul(rows) {
         Some(n) if n <= MAX_GRID_CELLS => Ok(()),
         Some(_) => Err("grid cell count exceeds maximum"),
         None => Err("grid cell count overflow"),
     }
 }

---- tests::test_validate_grid_dims stdout ----

thread 'tests::test_validate_grid_dims' (1525447) panicked at crates/idle-ipc/src/lib.rs:86:9:
assertion failed: validate_grid_dims(MAX_GRID_DIM + 1, 1).is_err()

failures:
    tests::test_validate_grid_dims

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
