*** crates/idle-ipc/src/ffi_cell.rs:71:20: replace match guard n <= MAX_GRID_CELLS with false in validate_grid_dims

*** mutation diff:
--- crates/idle-ipc/src/ffi_cell.rs
+++ replace match guard n <= MAX_GRID_CELLS with false in validate_grid_dims
@@ -63,17 +63,17 @@
 pub fn validate_grid_dims(cols: usize, rows: usize) -> Result<(), &'static str> {
     if cols == 0 || rows == 0 {
         return Err("grid dimensions must be non-zero");
     }
     if cols > MAX_GRID_DIM || rows > MAX_GRID_DIM {
         return Err("grid dimension exceeds maximum");
     }
     match cols.checked_mul(rows) {
-        Some(n) if n <= MAX_GRID_CELLS => Ok(()),
+        Some(n) if false /* ~ changed by cargo-mutants ~ */ => Ok(()),
         Some(_) => Err("grid cell count exceeds maximum"),
         None => Err("grid cell count overflow"),
     }
 }
 
 /// Byte size of header + `cols * rows` cells. `None` on overflow.
 pub fn compute_shm_size(cols: usize, rows: usize) -> Option<usize> {
     let cells = cols.checked_mul(rows)?;

---- tests::test_validate_grid_dims_boundaries stdout ----

thread 'tests::test_validate_grid_dims_boundaries' (1527699) panicked at crates/idle-ipc/src/lib.rs:94:9:
assertion failed: validate_grid_dims(MAX_GRID_DIM, 1).is_ok()

---- tests::test_validate_grid_dims stdout ----

thread 'tests::test_validate_grid_dims' (1527698) panicked at crates/idle-ipc/src/lib.rs:82:9:
assertion failed: validate_grid_dims(80, 24).is_ok()

failures:
    tests::test_validate_grid_dims
    tests::test_validate_grid_dims_boundaries

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
