*** crates/idle-ipc/src/ffi_cell.rs:79:5: replace compute_shm_size -> Option<usize> with None

*** mutation diff:
--- crates/idle-ipc/src/ffi_cell.rs
+++ replace compute_shm_size -> Option<usize> with None
@@ -71,12 +71,10 @@
         Some(n) if n <= MAX_GRID_CELLS => Ok(()),
         Some(_) => Err("grid cell count exceeds maximum"),
         None => Err("grid cell count overflow"),
     }
 }
 
 /// Byte size of header + `cols * rows` cells. `None` on overflow.
 pub fn compute_shm_size(cols: usize, rows: usize) -> Option<usize> {
-    let cells = cols.checked_mul(rows)?;
-    let cell_bytes = cells.checked_mul(std::mem::size_of::<FfiTerminalCell>())?;
-    std::mem::size_of::<SharedMemoryHeader>().checked_add(cell_bytes)
+    None /* ~ changed by cargo-mutants ~ */
 }

---- shm::tests::cells_mut_accepts_zero_or_correct_magic stdout ----

thread 'shm::tests::cells_mut_accepts_zero_or_correct_magic' (1528187) panicked at crates/idle-ipc/src/shm_tests.rs:107:46:
size

---- shm::tests::cells_mut_rejects_bad_magic stdout ----

thread 'shm::tests::cells_mut_rejects_bad_magic' (1528188) panicked at crates/idle-ipc/src/shm_tests.rs:93:46:
size

---- shm::tests::cells_mut_rejects_dims_exceeding_map stdout ----

thread 'shm::tests::cells_mut_rejects_dims_exceeding_map' (1528189) panicked at crates/idle-ipc/src/shm_tests.rs:125:46:
size

failures:
    proptests::shm_size_monotonic
    shm::tests::cells_mut_accepts_zero_or_correct_magic
    shm::tests::cells_mut_rejects_bad_magic
    shm::tests::cells_mut_rejects_dims_exceeding_map
    shm::tests::create_open_roundtrip_name
    tests::test_compute_shm_size_zero_dimensions
    tests::test_shm_size

test result: FAILED. 25 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
