*** crates/idle-ipc/src/path_safety.rs:12:24: replace || with && in is_valid_shm_name

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace || with && in is_valid_shm_name
@@ -4,17 +4,17 @@
 //! Path / name validation for IPC sockets and POSIX SHM objects.
 
 /// POSIX SHM object names we create look like `/trance-shm-<pid>-<idx>`.
 /// Reject anything else so a compromised arg vector cannot open arbitrary objects.
 pub fn is_valid_shm_name(name: &str) -> bool {
     let Some(rest) = name.strip_prefix("/trance-shm-") else {
         return false;
     };
-    if rest.is_empty() || rest.len() > 64 {
+    if rest.is_empty() && /* ~ changed by cargo-mutants ~ */ rest.len() > 64 {
         return false;
     }
     rest.chars()
         .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.

---- path_safety::tests::shm_name_rejects_traversal_and_oddities stdout ----

thread 'path_safety::tests::shm_name_rejects_traversal_and_oddities' (1529662) panicked at crates/idle-ipc/src/path_safety.rs:54:9:
assertion failed: !is_valid_shm_name("/trance-shm-")

failures:
    path_safety::tests::shm_name_rejects_traversal_and_oddities

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
