*** crates/idle-ipc/src/path_safety.rs:16:61: replace == with != in is_valid_shm_name

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace == with != in is_valid_shm_name
@@ -8,17 +8,17 @@
 pub fn is_valid_shm_name(name: &str) -> bool {
     let Some(rest) = name.strip_prefix("/trance-shm-") else {
         return false;
     };
     if rest.is_empty() || rest.len() > 64 {
         return false;
     }
     rest.chars()
-        .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
+        .all(|c| c.is_ascii_alphanumeric() || c == '-' || c != /* ~ changed by cargo-mutants ~ */ '_')
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.
 pub fn is_plausible_socket_path(path: &str) -> bool {
     if path.is_empty() || path.len() >= 108 {
         return false;
     }

---- path_safety::tests::shm_name_accepts_daemon_format stdout ----

thread 'path_safety::tests::shm_name_accepts_daemon_format' (1531278) panicked at crates/idle-ipc/src/path_safety.rs:42:9:
assertion failed: is_valid_shm_name("/trance-shm-test_name-0")

---- path_safety::tests::shm_name_rejects_traversal_and_oddities stdout ----

thread 'path_safety::tests::shm_name_rejects_traversal_and_oddities' (1531279) panicked at crates/idle-ipc/src/path_safety.rs:53:9:
assertion failed: !is_valid_shm_name("/trance-shm-../etc")

---- shm::tests::open_rejects_bad_name stdout ----

thread 'shm::tests::open_rejects_bad_name' (1531297) panicked at crates/idle-ipc/src/shm_tests.rs:27:21:
assertion failed: err.contains("invalid shm name")

failures:
    path_safety::tests::shm_name_accepts_daemon_format
    path_safety::tests::shm_name_rejects_traversal_and_oddities
    shm::tests::open_rejects_bad_name

test result: FAILED. 29 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
