*** crates/idle-ipc/src/path_safety.rs:22:24: replace || with && in is_plausible_socket_path

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace || with && in is_plausible_socket_path
@@ -14,17 +14,17 @@
     }
     rest.chars()
         .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.
 pub fn is_plausible_socket_path(path: &str) -> bool {
-    if path.is_empty() || path.len() >= 108 {
+    if path.is_empty() && /* ~ changed by cargo-mutants ~ */ path.len() >= 108 {
         return false;
     }
     if path.contains('\0') || !path.starts_with('/') || !path.ends_with(".sock") {
         return false;
     }
     if path.split('/').any(|seg| seg == "..") {
         return false;
     }

---- path_safety::tests::socket_path_accepts_tmp_and_runtime stdout ----

thread 'path_safety::tests::socket_path_accepts_tmp_and_runtime' (1532158) panicked at crates/idle-ipc/src/path_safety.rs:98:9:
assertion failed: !is_plausible_socket_path(&bad_108)

---- path_safety::tests::socket_path_rejects_relative_and_dots stdout ----

thread 'path_safety::tests::socket_path_rejects_relative_and_dots' (1532160) panicked at crates/idle-ipc/src/path_safety.rs:79:9:
assertion failed: !is_plausible_socket_path(&format!("/{}.sock", "a".repeat(108)))

failures:
    path_safety::tests::socket_path_accepts_tmp_and_runtime
    path_safety::tests::socket_path_rejects_relative_and_dots

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
