*** crates/idle-ipc/src/path_safety.rs:22:38: replace >= with < in is_plausible_socket_path

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace >= with < in is_plausible_socket_path
@@ -14,17 +14,17 @@
     }
     rest.chars()
         .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.
 pub fn is_plausible_socket_path(path: &str) -> bool {
-    if path.is_empty() || path.len() >= 108 {
+    if path.is_empty() || path.len() < /* ~ changed by cargo-mutants ~ */ 108 {
         return false;
     }
     if path.contains('\0') || !path.starts_with('/') || !path.ends_with(".sock") {
         return false;
     }
     if path.split('/').any(|seg| seg == "..") {
         return false;
     }

---- path_safety::tests::socket_path_accepts_tmp_and_runtime stdout ----

thread 'path_safety::tests::socket_path_accepts_tmp_and_runtime' (1532413) panicked at crates/idle-ipc/src/path_safety.rs:88:9:
assertion failed: is_plausible_socket_path("/tmp/trance-uds-1-0.sock")

---- path_safety::tests::socket_path_rejects_relative_and_dots stdout ----

thread 'path_safety::tests::socket_path_rejects_relative_and_dots' (1532415) panicked at crates/idle-ipc/src/path_safety.rs:71:9:
assertion failed: is_plausible_socket_path("/run/user/1000/trance-uds-1-0.sock")

failures:
    path_safety::tests::socket_path_accepts_tmp_and_runtime
    path_safety::tests::socket_path_rejects_relative_and_dots

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
