*** crates/idle-ipc/src/path_safety.rs:9:5: replace is_valid_shm_name -> bool with true

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace is_valid_shm_name -> bool with true
@@ -1,24 +1,17 @@
 // SPDX-License-Identifier: Apache-2.0
 // Copyright 2026 IdleScreen
 
 //! Path / name validation for IPC sockets and POSIX SHM objects.
 
 /// POSIX SHM object names we create look like `/trance-shm-<pid>-<idx>`.
 /// Reject anything else so a compromised arg vector cannot open arbitrary objects.
 pub fn is_valid_shm_name(name: &str) -> bool {
-    let Some(rest) = name.strip_prefix("/trance-shm-") else {
-        return false;
-    };
-    if rest.is_empty() || rest.len() > 64 {
-        return false;
-    }
-    rest.chars()
-        .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.
 pub fn is_plausible_socket_path(path: &str) -> bool {
     if path.is_empty() || path.len() >= 108 {
         return false;
     }

---- path_safety::tests::shm_name_rejects_traversal_and_oddities stdout ----

thread 'path_safety::tests::shm_name_rejects_traversal_and_oddities' (1529154) panicked at crates/idle-ipc/src/path_safety.rs:44:9:
assertion failed: !is_valid_shm_name("trance-shm-1-0")

---- shm::tests::create_rejects_bad_name stdout ----

thread 'shm::tests::create_rejects_bad_name' (1529169) panicked at crates/idle-ipc/src/shm_tests.rs:16:18:
expected invalid name error

---- shm::tests::open_rejects_bad_name stdout ----

thread 'shm::tests::open_rejects_bad_name' (1529172) panicked at crates/idle-ipc/src/shm_tests.rs:23:21:
assertion failed: err.contains("invalid shm name")

failures:
    path_safety::tests::shm_name_rejects_traversal_and_oddities
    shm::tests::create_rejects_bad_name
    shm::tests::open_rejects_bad_name

test result: FAILED. 29 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
