*** crates/idle-ipc/src/protocol.rs:70:13: delete match arm 3 in IpcCommand::read_from

*** mutation diff:
--- crates/idle-ipc/src/protocol.rs
+++ delete match arm 3 in IpcCommand::read_from
@@ -62,17 +62,17 @@
             }
             2 => {
                 let mut hz_bytes = [0u8; 4];
                 reader.read_exact(&mut hz_bytes)?;
                 Ok(IpcCommand::SetSimulationRate {
                     hz: f32::from_le_bytes(hz_bytes),
                 })
             }
-            3 => Ok(IpcCommand::Stop),
+             /* ~ changed by cargo-mutants ~ */
             _ => Err(std::io::Error::new(
                 std::io::ErrorKind::InvalidData,
                 "invalid command tag",
             )),
         }
     }
 }

---- proptests::command_roundtrip stdout ----

thread 'proptests::command_roundtrip' (1534749) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Custom { kind: InvalidData, error: "invalid command tag" }

thread 'proptests::command_roundtrip' (1534749) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Custom { kind: InvalidData, error: "invalid command tag" }
proptest: Saving this and future failures in /tmp/cargo-mutants-idle-audit-graph-7r3Pvg.tmp/crates/idle-ipc/proptest-regressions/lib.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc deb6d31656308a1449981000856c0ec36b80a38967f83651eabe21302914e918

thread 'proptests::command_roundtrip' (1534749) panicked at crates/idle-ipc/src/lib.rs:170:5:
Test failed: read: Custom { kind: InvalidData, error: "invalid command tag" }.
minimal failing input: cmd = Stop

---- tests::test_ipc_commands stdout ----

thread 'tests::test_ipc_commands' (1534794) panicked at crates/idle-ipc/src/lib.rs:38:59:
decode command: Custom { kind: InvalidData, error: "invalid command tag" }

failures:
    proptests::command_roundtrip
    tests::test_ipc_commands

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
