*** crates/idle-ipc/src/protocol.rs:81:9: replace IpcResponse::write_to -> std::io::Result<()> with Ok(())

*** mutation diff:
--- crates/idle-ipc/src/protocol.rs
+++ replace IpcResponse::write_to -> std::io::Result<()> with Ok(())
@@ -73,28 +73,17 @@
                 "invalid command tag",
             )),
         }
     }
 }
 
 impl IpcResponse {
     pub fn write_to<W: std::io::Write>(&self, mut writer: W) -> std::io::Result<()> {
-        match self {
-            IpcResponse::Ready => {
-                writer.write_all(&[0])?;
-            }
-            IpcResponse::FrameReady { scanlines } => {
-                writer.write_all(&[1, if *scanlines { 1 } else { 0 }])?;
-            }
-            IpcResponse::Ack => {
-                writer.write_all(&[2])?;
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn read_from<R: std::io::Read>(mut reader: R) -> std::io::Result<Self> {
         let mut tag = [0u8; 1];
         reader.read_exact(&mut tag)?;
         match tag[0] {
             0 => Ok(IpcResponse::Ready),
             1 => {

---- proptests::response_roundtrip stdout ----

thread 'proptests::response_roundtrip' (1535243) panicked at crates/idle-ipc/src/lib.rs:187:60:
read: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

thread 'proptests::response_roundtrip' (1535243) panicked at crates/idle-ipc/src/lib.rs:187:60:
read: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

thread 'proptests::response_roundtrip' (1535243) panicked at crates/idle-ipc/src/lib.rs:187:60:
read: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

thread 'proptests::response_roundtrip' (1535243) panicked at crates/idle-ipc/src/lib.rs:170:5:
Test failed: read: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }.
minimal failing input: resp = Ready

---- tests::test_ipc_responses stdout ----

thread 'tests::test_ipc_responses' (1535261) panicked at crates/idle-ipc/src/lib.rs:55:60:
decode response: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

failures:
    proptests::response_roundtrip
    tests::test_ipc_responses

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
