*** crates/idle-ipc/src/protocol.rs:99:13: delete match arm 0 in IpcResponse::read_from

*** mutation diff:
--- crates/idle-ipc/src/protocol.rs
+++ delete match arm 0 in IpcResponse::read_from
@@ -91,17 +91,17 @@
         }
         Ok(())
     }
 
     pub fn read_from<R: std::io::Read>(mut reader: R) -> std::io::Result<Self> {
         let mut tag = [0u8; 1];
         reader.read_exact(&mut tag)?;
         match tag[0] {
-            0 => Ok(IpcResponse::Ready),
+             /* ~ changed by cargo-mutants ~ */
             1 => {
                 let mut scan_byte = [0u8; 1];
                 reader.read_exact(&mut scan_byte)?;
                 Ok(IpcResponse::FrameReady {
                     scanlines: scan_byte[0] != 0,
                 })
             }
             2 => Ok(IpcResponse::Ack),

---- proptests::response_roundtrip stdout ----

thread 'proptests::response_roundtrip' (1535368) panicked at crates/idle-ipc/src/lib.rs:187:60:
read: Custom { kind: InvalidData, error: "invalid response tag" }

thread 'proptests::response_roundtrip' (1535368) panicked at crates/idle-ipc/src/lib.rs:170:5:
Test failed: read: Custom { kind: InvalidData, error: "invalid response tag" }.
minimal failing input: resp = Ready
	successes: 0
	local rejects: 0
	global rejects: 0

---- tests::test_ipc_responses stdout ----

thread 'tests::test_ipc_responses' (1535386) panicked at crates/idle-ipc/src/lib.rs:55:60:
decode response: Custom { kind: InvalidData, error: "invalid response tag" }

failures:
    proptests::response_roundtrip
    tests::test_ipc_responses

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
