*** crates/idle-ipc/src/shm.rs:104:17: replace < with == in SharedMemory::open

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace < with == in SharedMemory::open
@@ -96,17 +96,17 @@
             is_owner: true,
         })
     }
 
     pub fn open(name: &str, size: usize) -> Result<Self, String> {
         if !is_valid_shm_name(name) {
             return Err(format!("invalid shm name: {name}"));
         }
-        if size < std::mem::size_of::<SharedMemoryHeader>() || size > 64 * 1024 * 1024 {
+        if size == /* ~ changed by cargo-mutants ~ */ std::mem::size_of::<SharedMemoryHeader>() || size > 64 * 1024 * 1024 {
             return Err(format!("shm size out of range: {size}"));
         }
         let c_name = CString::new(name).map_err(|e| e.to_string())?;
 
         // SAFETY: open existing named object; name validated above.
         let fd = unsafe { libc::shm_open(c_name.as_ptr(), libc::O_RDWR, 0) };
         if fd < 0 {
             return Err(format!(

---- shm::tests::open_rejects_size_out_of_range stdout ----

thread 'shm::tests::open_rejects_size_out_of_range' (1543457) panicked at crates/idle-ipc/src/shm_tests.rs:56:21:
tiny: shm_open (open) failed: No such file or directory (os error 2)

failures:
    shm::tests::open_rejects_size_out_of_range

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
