*** crates/idle-ipc/src/shm.rs:129:16: replace == with != in SharedMemory::open

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace == with != in SharedMemory::open
@@ -121,17 +121,17 @@
                 ptr::null_mut(),
                 size,
                 libc::PROT_READ | libc::PROT_WRITE,
                 libc::MAP_SHARED,
                 fd,
                 0,
             )
         };
-        if ptr == libc::MAP_FAILED {
+        if ptr != /* ~ changed by cargo-mutants ~ */ libc::MAP_FAILED {
             let err = std::io::Error::last_os_error();
             // SAFETY: fd is open and owned by this path only.
             unsafe {
                 libc::close(fd);
             }
             return Err(format!("mmap failed: {err}"));
         }

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1547145) panicked at crates/idle-ipc/src/shm_tests.rs:168:51:
open while owner live: "mmap failed: No such file or directory (os error 2)"

failures:
    shm::tests::create_open_roundtrip_name

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
