*** crates/idle-ipc/src/shm.rs:148:9: replace SharedMemory::fd -> libc::c_int with Default::default()

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace SharedMemory::fd -> libc::c_int with Default::default()
@@ -140,17 +140,17 @@
             fd,
             ptr,
             size,
             is_owner: false,
         })
     }
 
     pub fn fd(&self) -> libc::c_int {
-        self.fd
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn ptr(&self) -> *mut libc::c_void {
         self.ptr
     }
 
     pub fn size(&self) -> usize {
         self.size

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1547443) panicked at crates/idle-ipc/src/shm_tests.rs:147:5:
assertion failed: owner.fd() > 0

---- shm::tests::create_accepts_header_mid_and_max_sizes stdout ----

thread 'shm::tests::create_accepts_header_mid_and_max_sizes' (1547441) panicked at crates/idle-ipc/src/shm_tests.rs:76:5:
live fd, got 0

failures:
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
