*** crates/idle-ipc/src/shm.rs:152:9: replace SharedMemory::ptr -> *mut libc::c_void with Default::default()

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace SharedMemory::ptr -> *mut libc::c_void with Default::default()
@@ -144,17 +144,17 @@
         })
     }
 
     pub fn fd(&self) -> libc::c_int {
         self.fd
     }
 
     pub fn ptr(&self) -> *mut libc::c_void {
-        self.ptr
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn size(&self) -> usize {
         self.size
     }
 
     pub fn name(&self) -> &str {
         &self.name

---- shm::tests::create_accepts_header_mid_and_max_sizes stdout ----

thread 'shm::tests::create_accepts_header_mid_and_max_sizes' (1547788) panicked at crates/idle-ipc/src/shm_tests.rs:77:5:
assertion failed: !a.ptr().is_null()

failures:
    shm::tests::create_accepts_header_mid_and_max_sizes

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
