*** crates/idle-ipc/src/shm.rs:222:9: replace <impl Drop for SharedMemory>::drop with ()

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace <impl Drop for SharedMemory>::drop with ()
@@ -214,29 +214,15 @@
         Ok(unsafe { std::slice::from_raw_parts_mut(cells_ptr, count) })
     }
 }
 
 impl Drop for SharedMemory {
     fn drop(&mut self) {
         // SAFETY: reverse of create/open — unmap, close fd, unlink if we own the name.
         // Null/`MAP_FAILED` and fd < 0 guard against double-free after partial init.
-        unsafe {
-            if !self.ptr.is_null() && self.ptr != libc::MAP_FAILED {
-                libc::munmap(self.ptr, self.size);
-                self.ptr = ptr::null_mut();
-            }
-            if self.fd >= 0 {
-                libc::close(self.fd);
-                self.fd = -1;
-            }
-            if self.is_owner
-                && let Ok(c_name) = CString::new(self.name.as_str())
-            {
-                libc::shm_unlink(c_name.as_ptr());
-            }
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 #[path = "shm_tests.rs"]
 mod tests;

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1549062) panicked at crates/idle-ipc/src/shm_tests.rs:180:5:
open after owner drop should fail

failures:
    shm::tests::create_open_roundtrip_name

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
