*** crates/idle-ipc/src/shm.rs:33:69: replace > with == in SharedMemory::create

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace > with == in SharedMemory::create
@@ -25,17 +25,17 @@
 // mapping is a protocol concern (single writer per field), not a Send concern.
 unsafe impl Send for SharedMemory {}
 
 impl SharedMemory {
     pub fn create(name: &str, size: usize) -> Result<Self, String> {
         if !is_valid_shm_name(name) {
             return Err(format!("invalid shm name: {name}"));
         }
-        if size < std::mem::size_of::<SharedMemoryHeader>() || size > 64 * 1024 * 1024 {
+        if size < std::mem::size_of::<SharedMemoryHeader>() || size == /* ~ changed by cargo-mutants ~ */ 64 * 1024 * 1024 {
             return Err(format!("shm size out of range: {size}"));
         }
         let c_name = CString::new(name).map_err(|e| e.to_string())?;
 
         // Named POSIX SHM only: the IPC child re-opens by name (`SharedMemory::open`).
         // O_EXCL + 0600: refuse squatters and keep the object owner-private.
         // SAFETY: `c_name` is a valid CString; unlink best-effort for stale objects.
         unsafe {

---- shm::tests::create_rejects_oversized stdout ----

thread 'shm::tests::create_rejects_oversized' (1537575) panicked at crates/idle-ipc/src/shm_tests.rs:49:18:
expected size error

---- shm::tests::create_accepts_header_mid_and_max_sizes stdout ----

thread 'shm::tests::create_accepts_header_mid_and_max_sizes' (1537572) panicked at crates/idle-ipc/src/shm_tests.rs:87:69:
exact max: "shm size out of range: 67108864"

failures:
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_rejects_oversized

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
