*** crates/idle-ipc/src/shm.rs:48:31: replace | with & in SharedMemory::create

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace | with & in SharedMemory::create
@@ -40,17 +40,17 @@
         // SAFETY: `c_name` is a valid CString; unlink best-effort for stale objects.
         unsafe {
             libc::shm_unlink(c_name.as_ptr());
         }
         // SAFETY: O_CREAT|O_EXCL|O_RDWR with mode 0600 on a validated name.
         let fd = unsafe {
             libc::shm_open(
                 c_name.as_ptr(),
-                libc::O_CREAT | libc::O_RDWR | libc::O_EXCL,
+                libc::O_CREAT & /* ~ changed by cargo-mutants ~ */ libc::O_RDWR | libc::O_EXCL,
                 0o600,
             )
         };
         if fd < 0 {
             return Err(format!(
                 "shm_open (create) failed: {}",
                 std::io::Error::last_os_error()
             ));

---- shm::tests::cells_mut_rejects_bad_magic stdout ----

thread 'shm::tests::cells_mut_rejects_bad_magic' (1540151) panicked at crates/idle-ipc/src/shm_tests.rs:94:70:
create: "shm_open (create) failed: No such file or directory (os error 2)"

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1540154) panicked at crates/idle-ipc/src/shm_tests.rs:144:50:
create: "shm_open (create) failed: No such file or directory (os error 2)"

---- shm::tests::cells_mut_rejects_dims_exceeding_map stdout ----

thread 'shm::tests::cells_mut_rejects_dims_exceeding_map' (1540152) panicked at crates/idle-ipc/src/shm_tests.rs:126:69:
create: "shm_open (create) failed: No such file or directory (os error 2)"

failures:
    shm::tests::cells_mut_accepts_zero_or_correct_magic
    shm::tests::cells_mut_rejects_bad_magic
    shm::tests::cells_mut_rejects_dims_exceeding_map
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name

test result: FAILED. 27 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
