*** crates/idle-ipc/src/ffi_cell.rs:10:39: replace * with /

*** mutation diff:
--- crates/idle-ipc/src/ffi_cell.rs
+++ replace * with /
@@ -2,17 +2,17 @@
 // Copyright 2026 IdleScreen
 
 use idle_api::TerminalCell;
 
 /// Hard cap on a single grid axis (cols or rows) for IPC shared memory.
 pub const MAX_GRID_DIM: usize = 4096;
 
 /// Hard cap on total cells (`cols * rows`) to bound SHM / mmap DoS.
-pub const MAX_GRID_CELLS: usize = 512 * 512;
+pub const MAX_GRID_CELLS: usize = 512 / /* ~ changed by cargo-mutants ~ */ 512;
 
 /// FFI-safe representation of `TerminalCell` for shared memory communication.
 #[repr(C)]
 #[derive(Clone, Copy, Debug, PartialEq, Eq)]
 pub struct FfiTerminalCell {
     pub ch: u32,
     pub fg_r: u8,
     pub fg_g: u8,

---- tests::test_validate_grid_dims_boundaries stdout ----

thread 'tests::test_validate_grid_dims_boundaries' (1555995) panicked at crates/idle-ipc/src/lib.rs:94:9:
assertion failed: validate_grid_dims(MAX_GRID_DIM, 1).is_ok()

---- tests::test_validate_grid_dims stdout ----

thread 'tests::test_validate_grid_dims' (1555994) panicked at crates/idle-ipc/src/lib.rs:82:9:
assertion failed: validate_grid_dims(80, 24).is_ok()

failures:
    tests::test_validate_grid_dims
    tests::test_validate_grid_dims_boundaries

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
