*** crates/idle-ipc/src/ffi_cell.rs:43:9: replace <impl From<FfiTerminalCell> for TerminalCell>::from -> Self with Default::default()

*** mutation diff:
--- crates/idle-ipc/src/ffi_cell.rs
+++ replace <impl From<FfiTerminalCell> for TerminalCell>::from -> Self with Default::default()
@@ -35,22 +35,17 @@
             bg_b: cell.bg.2,
             bold: if cell.bold { 1 } else { 0 },
         }
     }
 }
 
 impl From<FfiTerminalCell> for TerminalCell {
     fn from(ffi: FfiTerminalCell) -> Self {
-        Self {
-            ch: std::char::from_u32(ffi.ch).unwrap_or(' '),
-            fg: (ffi.fg_r, ffi.fg_g, ffi.fg_b),
-            bg: (ffi.bg_r, ffi.bg_g, ffi.bg_b),
-            bold: ffi.bold != 0,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[repr(C)]
 pub struct SharedMemoryHeader {
     pub magic: u32,
     pub cols: u32,
     pub rows: u32,

---- tests::test_ffi_terminal_cell_conversion stdout ----

thread 'tests::test_ffi_terminal_cell_conversion' (1552469) panicked at crates/idle-ipc/src/lib.rs:123:9:
assertion `left == right` failed
  left: TerminalCell { ch: '★', fg: (255, 128, 64), bg: (10, 20, 30), bold: true }
 right: TerminalCell { ch: ' ', fg: (248, 248, 242), bg: (0, 0, 0), bold: false }

failures:
    tests::test_ffi_terminal_cell_conversion

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
