*** crates/idle-ipc/src/ffi_cell.rs:64:13: replace == with != in validate_grid_dims

*** mutation diff:
--- crates/idle-ipc/src/ffi_cell.rs
+++ replace == with != in validate_grid_dims
@@ -56,17 +56,17 @@
     pub rows: u32,
     pub frame_counter: u64,
 }
 
 pub const SHM_MAGIC: u32 = 0x54524e43;
 
 /// Reject zero, oversized, or overflowing grid dimensions before SHM allocate.
 pub fn validate_grid_dims(cols: usize, rows: usize) -> Result<(), &'static str> {
-    if cols == 0 || rows == 0 {
+    if cols != /* ~ changed by cargo-mutants ~ */ 0 || rows == 0 {
         return Err("grid dimensions must be non-zero");
     }
     if cols > MAX_GRID_DIM || rows > MAX_GRID_DIM {
         return Err("grid dimension exceeds maximum");
     }
     match cols.checked_mul(rows) {
         Some(n) if n <= MAX_GRID_CELLS => Ok(()),
         Some(_) => Err("grid cell count exceeds maximum"),

---- tests::test_validate_grid_dims stdout ----

thread 'tests::test_validate_grid_dims' (1553715) panicked at crates/idle-ipc/src/lib.rs:82:9:
assertion failed: validate_grid_dims(80, 24).is_ok()

---- tests::test_validate_grid_dims_boundaries stdout ----

thread 'tests::test_validate_grid_dims_boundaries' (1553716) panicked at crates/idle-ipc/src/lib.rs:94:9:
assertion failed: validate_grid_dims(MAX_GRID_DIM, 1).is_ok()

failures:
    tests::test_validate_grid_dims
    tests::test_validate_grid_dims_boundaries

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
