*** crates/idle-ipc/src/ffi_cell.rs:64:5: replace validate_grid_dims -> Result<(), &'static str> with Ok(())

*** mutation diff:
--- crates/idle-ipc/src/ffi_cell.rs
+++ replace validate_grid_dims -> Result<(), &'static str> with Ok(())
@@ -56,27 +56,17 @@
     pub rows: u32,
     pub frame_counter: u64,
 }
 
 pub const SHM_MAGIC: u32 = 0x54524e43;
 
 /// Reject zero, oversized, or overflowing grid dimensions before SHM allocate.
 pub fn validate_grid_dims(cols: usize, rows: usize) -> Result<(), &'static str> {
-    if cols == 0 || rows == 0 {
-        return Err("grid dimensions must be non-zero");
-    }
-    if cols > MAX_GRID_DIM || rows > MAX_GRID_DIM {
-        return Err("grid dimension exceeds maximum");
-    }
-    match cols.checked_mul(rows) {
-        Some(n) if n <= MAX_GRID_CELLS => Ok(()),
-        Some(_) => Err("grid cell count exceeds maximum"),
-        None => Err("grid cell count overflow"),
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Byte size of header + `cols * rows` cells. `None` on overflow.
 pub fn compute_shm_size(cols: usize, rows: usize) -> Option<usize> {
     let cells = cols.checked_mul(rows)?;
     let cell_bytes = cells.checked_mul(std::mem::size_of::<FfiTerminalCell>())?;
     std::mem::size_of::<SharedMemoryHeader>().checked_add(cell_bytes)
 }

---- tests::test_validate_grid_dims stdout ----

thread 'tests::test_validate_grid_dims' (1553059) panicked at crates/idle-ipc/src/lib.rs:83:9:
assertion failed: validate_grid_dims(0, 24).is_err()

---- tests::test_validate_grid_dims_boundaries stdout ----

thread 'tests::test_validate_grid_dims_boundaries' (1553060) panicked at crates/idle-ipc/src/lib.rs:100:9:
assertion failed: validate_grid_dims(512, 513).is_err()

failures:
    tests::test_validate_grid_dims
    tests::test_validate_grid_dims_boundaries

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
