*** crates/idle-ipc/src/path_safety.rs:12:38: replace > with < in is_valid_shm_name

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace > with < in is_valid_shm_name
@@ -4,17 +4,17 @@
 //! Path / name validation for IPC sockets and POSIX SHM objects.
 
 /// POSIX SHM object names we create look like `/trance-shm-<pid>-<idx>`.
 /// Reject anything else so a compromised arg vector cannot open arbitrary objects.
 pub fn is_valid_shm_name(name: &str) -> bool {
     let Some(rest) = name.strip_prefix("/trance-shm-") else {
         return false;
     };
-    if rest.is_empty() || rest.len() > 64 {
+    if rest.is_empty() || rest.len() < /* ~ changed by cargo-mutants ~ */ 64 {
         return false;
     }
     rest.chars()
         .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.

---- path_safety::tests::shm_name_rejects_traversal_and_oddities stdout ----

thread 'path_safety::tests::shm_name_rejects_traversal_and_oddities' (1559015) panicked at crates/idle-ipc/src/path_safety.rs:59:9:
assertion failed: !is_valid_shm_name(&format!("/trance-shm-{}", "x".repeat(80)))

---- path_safety::tests::shm_name_accepts_daemon_format stdout ----

thread 'path_safety::tests::shm_name_accepts_daemon_format' (1559014) panicked at crates/idle-ipc/src/path_safety.rs:40:9:
assertion failed: is_valid_shm_name("/trance-shm-1234-0")

---- shm::tests::cells_mut_rejects_bad_magic stdout ----

thread 'shm::tests::cells_mut_rejects_bad_magic' (1559026) panicked at crates/idle-ipc/src/shm_tests.rs:103:70:
create: "invalid shm name: /trance-shm-test-magic-0"

failures:
    path_safety::tests::shm_name_accepts_daemon_format
    path_safety::tests::shm_name_rejects_traversal_and_oddities
    shm::tests::cells_mut_accepts_zero_or_correct_magic
    shm::tests::cells_mut_rejects_bad_magic
    shm::tests::cells_mut_rejects_dims_exceeding_map
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name
    shm::tests::create_rejects_tiny_size
    shm::tests::open_rejects_size_out_of_range

test result: FAILED. 23 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
