*** crates/idle-ipc/src/path_safety.rs:16:56: replace || with && in is_valid_shm_name

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace || with && in is_valid_shm_name
@@ -8,17 +8,17 @@
 pub fn is_valid_shm_name(name: &str) -> bool {
     let Some(rest) = name.strip_prefix("/trance-shm-") else {
         return false;
     };
     if rest.is_empty() || rest.len() > 64 {
         return false;
     }
     rest.chars()
-        .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
+        .all(|c| c.is_ascii_alphanumeric() || c == '-' && /* ~ changed by cargo-mutants ~ */ c == '_')
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.
 pub fn is_plausible_socket_path(path: &str) -> bool {
     if path.is_empty() || path.len() >= 108 {
         return false;
     }

---- path_safety::tests::shm_name_accepts_daemon_format stdout ----

thread 'path_safety::tests::shm_name_accepts_daemon_format' (1559522) panicked at crates/idle-ipc/src/path_safety.rs:40:9:
assertion failed: is_valid_shm_name("/trance-shm-1234-0")

---- shm::tests::cells_mut_rejects_dims_exceeding_map stdout ----

thread 'shm::tests::cells_mut_rejects_dims_exceeding_map' (1559535) panicked at crates/idle-ipc/src/shm_tests.rs:135:69:
create: "invalid shm name: /trance-shm-test-dims-0"

---- shm::tests::open_rejects_size_out_of_range stdout ----

thread 'shm::tests::open_rejects_size_out_of_range' (1559542) panicked at crates/idle-ipc/src/shm_tests.rs:56:21:
tiny: invalid shm name: /trance-shm-open-tiny-0

failures:
    path_safety::tests::shm_name_accepts_daemon_format
    shm::tests::cells_mut_accepts_zero_or_correct_magic
    shm::tests::cells_mut_rejects_bad_magic
    shm::tests::cells_mut_rejects_dims_exceeding_map
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name
    shm::tests::create_rejects_tiny_size
    shm::tests::open_rejects_size_out_of_range

test result: FAILED. 24 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
