*** crates/idle-ipc/src/path_safety.rs:22:5: replace is_plausible_socket_path -> bool with true

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace is_plausible_socket_path -> bool with true
@@ -14,26 +14,17 @@
     }
     rest.chars()
         .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.
 pub fn is_plausible_socket_path(path: &str) -> bool {
-    if path.is_empty() || path.len() >= 108 {
-        return false;
-    }
-    if path.contains('\0') || !path.starts_with('/') || !path.ends_with(".sock") {
-        return false;
-    }
-    if path.split('/').any(|seg| seg == "..") {
-        return false;
-    }
-    true
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn shm_name_accepts_daemon_format() {

---- path_safety::tests::socket_path_rejects_dotdot_middle_segment stdout ----

thread 'path_safety::tests::socket_path_rejects_dotdot_middle_segment' (1560514) panicked at crates/idle-ipc/src/path_safety.rs:94:9:
assertion failed: !is_plausible_socket_path("/run/../user/x.sock")

---- path_safety::tests::socket_path_rejects_relative_and_dots stdout ----

thread 'path_safety::tests::socket_path_rejects_relative_and_dots' (1560515) panicked at crates/idle-ipc/src/path_safety.rs:65:9:
assertion failed: !is_plausible_socket_path("relative.sock")

---- path_safety::tests::socket_path_accepts_tmp_and_runtime stdout ----

thread 'path_safety::tests::socket_path_accepts_tmp_and_runtime' (1560513) panicked at crates/idle-ipc/src/path_safety.rs:89:9:
assertion failed: !is_plausible_socket_path(&bad_108)

failures:
    path_safety::tests::socket_path_accepts_tmp_and_runtime
    path_safety::tests::socket_path_rejects_dotdot_middle_segment
    path_safety::tests::socket_path_rejects_relative_and_dots

test result: FAILED. 29 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
