*** crates/idle-ipc/src/path_safety.rs:22:5: replace is_plausible_socket_path -> bool with false

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace is_plausible_socket_path -> bool with false
@@ -14,26 +14,17 @@
     }
     rest.chars()
         .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.
 pub fn is_plausible_socket_path(path: &str) -> bool {
-    if path.is_empty() || path.len() >= 108 {
-        return false;
-    }
-    if path.contains('\0') || !path.starts_with('/') || !path.ends_with(".sock") {
-        return false;
-    }
-    if path.split('/').any(|seg| seg == "..") {
-        return false;
-    }
-    true
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn shm_name_accepts_daemon_format() {

---- path_safety::tests::socket_path_accepts_tmp_and_runtime stdout ----

thread 'path_safety::tests::socket_path_accepts_tmp_and_runtime' (1560555) panicked at crates/idle-ipc/src/path_safety.rs:79:9:
assertion failed: is_plausible_socket_path("/tmp/trance-uds-1-0.sock")

---- path_safety::tests::socket_path_rejects_relative_and_dots stdout ----

thread 'path_safety::tests::socket_path_rejects_relative_and_dots' (1560557) panicked at crates/idle-ipc/src/path_safety.rs:62:9:
assertion failed: is_plausible_socket_path("/run/user/1000/trance-uds-1-0.sock")

failures:
    path_safety::tests::socket_path_accepts_tmp_and_runtime
    path_safety::tests::socket_path_rejects_relative_and_dots

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
