*** crates/idle-ipc/src/path_safety.rs:9:5: replace is_valid_shm_name -> bool with false

*** mutation diff:
--- crates/idle-ipc/src/path_safety.rs
+++ replace is_valid_shm_name -> bool with false
@@ -1,24 +1,17 @@
 // SPDX-License-Identifier: Apache-2.0
 // Copyright 2026 IdleScreen
 
 //! Path / name validation for IPC sockets and POSIX SHM objects.
 
 /// POSIX SHM object names we create look like `/trance-shm-<pid>-<idx>`.
 /// Reject anything else so a compromised arg vector cannot open arbitrary objects.
 pub fn is_valid_shm_name(name: &str) -> bool {
-    let Some(rest) = name.strip_prefix("/trance-shm-") else {
-        return false;
-    };
-    if rest.is_empty() || rest.len() > 64 {
-        return false;
-    }
-    rest.chars()
-        .all(|c| c.is_ascii_alphanumeric() || c == '-' || c == '_')
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// UDS control paths must be absolute, end in `.sock`, stay under path limits,
 /// and must not contain nulls or `..` segments.
 pub fn is_plausible_socket_path(path: &str) -> bool {
     if path.is_empty() || path.len() >= 108 {
         return false;
     }

---- path_safety::tests::shm_name_accepts_daemon_format stdout ----

thread 'path_safety::tests::shm_name_accepts_daemon_format' (1558038) panicked at crates/idle-ipc/src/path_safety.rs:33:9:
assertion failed: is_valid_shm_name("/trance-shm-1234-0")

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1558053) panicked at crates/idle-ipc/src/shm_tests.rs:153:50:
create: "invalid shm name: /trance-shm-test-roundtrip-0"

---- shm::tests::create_rejects_tiny_size stdout ----

thread 'shm::tests::create_rejects_tiny_size' (1558056) panicked at crates/idle-ipc/src/shm_tests.rs:35:21:
assertion failed: err.contains("size")

failures:
    path_safety::tests::shm_name_accepts_daemon_format
    shm::tests::cells_mut_accepts_zero_or_correct_magic
    shm::tests::cells_mut_rejects_bad_magic
    shm::tests::cells_mut_rejects_dims_exceeding_map
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name
    shm::tests::create_rejects_tiny_size
    shm::tests::open_rejects_size_out_of_range

test result: FAILED. 24 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
