*** crates/idle-ipc/src/protocol.rs:104:45: replace != with == in IpcResponse::read_from

*** mutation diff:
--- crates/idle-ipc/src/protocol.rs
+++ replace != with == in IpcResponse::read_from
@@ -96,17 +96,17 @@
         let mut tag = [0u8; 1];
         reader.read_exact(&mut tag)?;
         match tag[0] {
             0 => Ok(IpcResponse::Ready),
             1 => {
                 let mut scan_byte = [0u8; 1];
                 reader.read_exact(&mut scan_byte)?;
                 Ok(IpcResponse::FrameReady {
-                    scanlines: scan_byte[0] != 0,
+                    scanlines: scan_byte[0] == /* ~ changed by cargo-mutants ~ */ 0,
                 })
             }
             2 => Ok(IpcResponse::Ack),
             _ => Err(std::io::Error::new(
                 std::io::ErrorKind::InvalidData,
                 "invalid response tag",
             )),
         }

---- proptests::response_roundtrip stdout ----

thread 'proptests::response_roundtrip' (1564911) panicked at crates/idle-ipc/src/lib.rs:170:5:
Test failed: assertion failed: `(left == right)` 
  left: `FrameReady { scanlines: false }`,
 right: `FrameReady { scanlines: true }` at crates/idle-ipc/src/lib.rs:188.
minimal failing input: resp = FrameReady {
    scanlines: false,
}
	successes: 0
	local rejects: 0
	global rejects: 0

---- tests::test_ipc_responses stdout ----

thread 'tests::test_ipc_responses' (1564929) panicked at crates/idle-ipc/src/lib.rs:56:13:
assertion `left == right` failed
  left: FrameReady { scanlines: true }
 right: FrameReady { scanlines: false }

failures:
    proptests::response_roundtrip
    tests::test_ipc_responses

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
