*** crates/idle-ipc/src/protocol.rs:21:9: replace IpcCommand::write_to -> std::io::Result<()> with Ok(())

*** mutation diff:
--- crates/idle-ipc/src/protocol.rs
+++ replace IpcCommand::write_to -> std::io::Result<()> with Ok(())
@@ -13,35 +13,17 @@
 pub enum IpcResponse {
     Ready,
     FrameReady { scanlines: bool },
     Ack,
 }
 
 impl IpcCommand {
     pub fn write_to<W: std::io::Write>(&self, mut writer: W) -> std::io::Result<()> {
-        match self {
-            IpcCommand::Init { cols, rows } => {
-                writer.write_all(&[0])?;
-                writer.write_all(&cols.to_le_bytes())?;
-                writer.write_all(&rows.to_le_bytes())?;
-            }
-            IpcCommand::TickAndDraw { dt_micros } => {
-                writer.write_all(&[1])?;
-                writer.write_all(&dt_micros.to_le_bytes())?;
-            }
-            IpcCommand::SetSimulationRate { hz } => {
-                writer.write_all(&[2])?;
-                writer.write_all(&hz.to_le_bytes())?;
-            }
-            IpcCommand::Stop => {
-                writer.write_all(&[3])?;
-            }
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn read_from<R: std::io::Read>(mut reader: R) -> std::io::Result<Self> {
         let mut tag = [0u8; 1];
         reader.read_exact(&mut tag)?;
         match tag[0] {
             0 => {
                 let mut cols_bytes = [0u8; 4];

---- tests::test_ipc_commands stdout ----

thread 'tests::test_ipc_commands' (1562621) panicked at crates/idle-ipc/src/lib.rs:38:59:
decode command: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

---- proptests::command_roundtrip stdout ----

thread 'proptests::command_roundtrip' (1562601) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

thread 'proptests::command_roundtrip' (1562601) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

thread 'proptests::command_roundtrip' (1562601) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

thread 'proptests::command_roundtrip' (1562601) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Error { kind: UnexpectedEof, message: "failed to fill whole buffer" }

failures:
    proptests::command_roundtrip
    tests::test_ipc_commands

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
