*** crates/idle-ipc/src/protocol.rs:63:13: delete match arm 2 in IpcCommand::read_from

*** mutation diff:
--- crates/idle-ipc/src/protocol.rs
+++ delete match arm 2 in IpcCommand::read_from
@@ -55,23 +55,17 @@
             }
             1 => {
                 let mut dt_bytes = [0u8; 8];
                 reader.read_exact(&mut dt_bytes)?;
                 Ok(IpcCommand::TickAndDraw {
                     dt_micros: u64::from_le_bytes(dt_bytes),
                 })
             }
-            2 => {
-                let mut hz_bytes = [0u8; 4];
-                reader.read_exact(&mut hz_bytes)?;
-                Ok(IpcCommand::SetSimulationRate {
-                    hz: f32::from_le_bytes(hz_bytes),
-                })
-            }
+             /* ~ changed by cargo-mutants ~ */
             3 => Ok(IpcCommand::Stop),
             _ => Err(std::io::Error::new(
                 std::io::ErrorKind::InvalidData,
                 "invalid command tag",
             )),
         }
     }
 }

---- proptests::command_roundtrip stdout ----

thread 'proptests::command_roundtrip' (1563583) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Custom { kind: InvalidData, error: "invalid command tag" }

thread 'proptests::command_roundtrip' (1563583) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Custom { kind: InvalidData, error: "invalid command tag" }

thread 'proptests::command_roundtrip' (1563583) panicked at crates/idle-ipc/src/lib.rs:178:59:
read: Custom { kind: InvalidData, error: "invalid command tag" }
proptest: Saving this and future failures in /tmp/cargo-mutants-idle-audit-graph-cD0Zdb.tmp/crates/idle-ipc/proptest-regressions/lib.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc 9fdae2eedcc018d21185640e17c7db38d22c7e8ec9016624a12d66dd9b1c9b44

---- tests::test_ipc_commands stdout ----

thread 'tests::test_ipc_commands' (1563603) panicked at crates/idle-ipc/src/lib.rs:38:59:
decode command: Custom { kind: InvalidData, error: "invalid command tag" }

failures:
    proptests::command_roundtrip
    tests::test_ipc_commands

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
