*** crates/idle-ipc/src/shm.rs:101:12: delete ! in SharedMemory::open

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ delete ! in SharedMemory::open
@@ -93,17 +93,17 @@
             fd,
             ptr,
             size,
             is_owner: true,
         })
     }
 
     pub fn open(name: &str, size: usize) -> Result<Self, String> {
-        if !is_valid_shm_name(name) {
+        if  /* ~ changed by cargo-mutants ~ */is_valid_shm_name(name) {
             return Err(format!("invalid shm name: {name}"));
         }
         if size < std::mem::size_of::<SharedMemoryHeader>() || size > 64 * 1024 * 1024 {
             return Err(format!("shm size out of range: {size}"));
         }
         let c_name = CString::new(name).map_err(|e| e.to_string())?;
 
         // SAFETY: open existing named object; name validated above.

---- shm::tests::open_rejects_bad_name stdout ----

thread 'shm::tests::open_rejects_bad_name' (1571788) panicked at crates/idle-ipc/src/shm_tests.rs:23:21:
assertion failed: err.contains("invalid shm name")

---- shm::tests::open_rejects_size_out_of_range stdout ----

thread 'shm::tests::open_rejects_size_out_of_range' (1571789) panicked at crates/idle-ipc/src/shm_tests.rs:56:21:
tiny: invalid shm name: /trance-shm-open-tiny-0

---- shm::tests::create_accepts_header_mid_and_max_sizes stdout ----

thread 'shm::tests::create_accepts_header_mid_and_max_sizes' (1571783) panicked at crates/idle-ipc/src/shm_tests.rs:79:68:
open header size: "invalid shm name: /trance-shm-test-hdr-0"

failures:
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name
    shm::tests::open_rejects_bad_name
    shm::tests::open_rejects_size_out_of_range

test result: FAILED. 28 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
