*** crates/idle-ipc/src/shm.rs:101:9: replace SharedMemory::open -> Result<Self, String> with Ok(Default::default())

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace SharedMemory::open -> Result<Self, String> with Ok(Default::default())
@@ -93,60 +93,17 @@
             fd,
             ptr,
             size,
             is_owner: true,
         })
     }
 
     pub fn open(name: &str, size: usize) -> Result<Self, String> {
-        if !is_valid_shm_name(name) {
-            return Err(format!("invalid shm name: {name}"));
-        }
-        if size < std::mem::size_of::<SharedMemoryHeader>() || size > 64 * 1024 * 1024 {
-            return Err(format!("shm size out of range: {size}"));
-        }
-        let c_name = CString::new(name).map_err(|e| e.to_string())?;
-
-        // SAFETY: open existing named object; name validated above.
-        let fd = unsafe { libc::shm_open(c_name.as_ptr(), libc::O_RDWR, 0) };
-        if fd < 0 {
-            return Err(format!(
-                "shm_open (open) failed: {}",
-                std::io::Error::last_os_error()
-            ));
-        }
-
-        // SAFETY: MAP_SHARED; close fd on MAP_FAILED (non-owner does not unlink).
-        let ptr = unsafe {
-            libc::mmap(
-                ptr::null_mut(),
-                size,
-                libc::PROT_READ | libc::PROT_WRITE,
-                libc::MAP_SHARED,
-                fd,
-                0,
-            )
-        };
-        if ptr == libc::MAP_FAILED {
-            let err = std::io::Error::last_os_error();
-            // SAFETY: fd is open and owned by this path only.
-            unsafe {
-                libc::close(fd);
-            }
-            return Err(format!("mmap failed: {err}"));
-        }
-
-        Ok(Self {
-            name: name.to_string(),
-            fd,
-            ptr,
-            size,
-            is_owner: false,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn fd(&self) -> libc::c_int {
         self.fd
     }
 
     pub fn ptr(&self) -> *mut libc::c_void {
         self.ptr

error[E0277]: the trait bound `SharedMemory: Default` is not satisfied
   --> crates/idle-ipc/src/shm.rs:101:12
    |
101 |         Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
    |            ^^^^^^^^^^^^^^^^^^ the trait `Default` is not implemented for `SharedMemory`
    |
help: consider annotating `SharedMemory` with `#[derive(Default)]`
    |
 15 + #[derive(Default)]
 16 | pub struct SharedMemory {
    |

error[E0277]: the trait bound `shm::SharedMemory: Default` is not satisfied
   --> crates/idle-ipc/src/shm.rs:101:12
    |
101 |         Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
    |            ^^^^^^^^^^^^^^^^^^ the trait `Default` is not implemented for `shm::SharedMemory`
    |
help: consider annotating `shm::SharedMemory` with `#[derive(Default)]`
    |
 15 + #[derive(Default)]
 16 | pub struct SharedMemory {
    |

*** result: Failure(101)
