*** crates/idle-ipc/src/shm.rs:111:15: replace < with > in SharedMemory::open

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace < with > in SharedMemory::open
@@ -103,17 +103,17 @@
         }
         if size < std::mem::size_of::<SharedMemoryHeader>() || size > 64 * 1024 * 1024 {
             return Err(format!("shm size out of range: {size}"));
         }
         let c_name = CString::new(name).map_err(|e| e.to_string())?;
 
         // SAFETY: open existing named object; name validated above.
         let fd = unsafe { libc::shm_open(c_name.as_ptr(), libc::O_RDWR, 0) };
-        if fd < 0 {
+        if fd > /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(format!(
                 "shm_open (open) failed: {}",
                 std::io::Error::last_os_error()
             ));
         }
 
         // SAFETY: MAP_SHARED; close fd on MAP_FAILED (non-owner does not unlink).
         let ptr = unsafe {

---- shm::tests::create_accepts_header_mid_and_max_sizes stdout ----

thread 'shm::tests::create_accepts_header_mid_and_max_sizes' (1574880) panicked at crates/idle-ipc/src/shm_tests.rs:79:68:
open header size: "shm_open (open) failed: No such file or directory (os error 2)"

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1574881) panicked at crates/idle-ipc/src/shm_tests.rs:177:51:
open while owner live: "shm_open (open) failed: No such file or directory (os error 2)"

failures:
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
