*** crates/idle-ipc/src/shm.rs:156:9: replace SharedMemory::size -> usize with 0

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace SharedMemory::size -> usize with 0
@@ -148,17 +148,17 @@
         self.fd
     }
 
     pub fn ptr(&self) -> *mut libc::c_void {
         self.ptr
     }
 
     pub fn size(&self) -> usize {
-        self.size
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn name(&self) -> &str {
         &self.name
     }
 
     /// Mutable header view.
     ///

---- shm::tests::create_accepts_header_mid_and_max_sizes stdout ----

thread 'shm::tests::create_accepts_header_mid_and_max_sizes' (1576887) panicked at crates/idle-ipc/src/shm_tests.rs:74:5:
assertion `left == right` failed
  left: 0
 right: 24

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1576888) panicked at crates/idle-ipc/src/shm_tests.rs:155:5:
assertion `left == right` failed
  left: 0
 right: 120

failures:
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
