*** crates/idle-ipc/src/shm.rs:160:9: replace SharedMemory::name -> &str with ""

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace SharedMemory::name -> &str with ""
@@ -152,17 +152,17 @@
         self.ptr
     }
 
     pub fn size(&self) -> usize {
         self.size
     }
 
     pub fn name(&self) -> &str {
-        &self.name
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Mutable header view.
     ///
     /// # Safety
     /// - Mapping is live (`create`/`open` succeeded; `Drop` not yet run).
     /// - Caller serializes writers (daemon initializes; runner updates counter).
     /// - `self.size >= size_of::<SharedMemoryHeader>()` (enforced at open/create).

---- shm::tests::create_accepts_header_mid_and_max_sizes stdout ----

thread 'shm::tests::create_accepts_header_mid_and_max_sizes' (1577396) panicked at crates/idle-ipc/src/shm_tests.rs:75:5:
assertion `left == right` failed
  left: ""
 right: "/trance-shm-test-hdr-0"

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1577397) panicked at crates/idle-ipc/src/shm_tests.rs:154:5:
assertion `left == right` failed
  left: ""
 right: "/trance-shm-test-roundtrip-0"

failures:
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name

test result: FAILED. 30 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
