*** crates/idle-ipc/src/shm.rs:229:27: delete - in <impl Drop for SharedMemory>::drop

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ delete - in <impl Drop for SharedMemory>::drop
@@ -221,17 +221,17 @@
         // Null/`MAP_FAILED` and fd < 0 guard against double-free after partial init.
         unsafe {
             if !self.ptr.is_null() && self.ptr != libc::MAP_FAILED {
                 libc::munmap(self.ptr, self.size);
                 self.ptr = ptr::null_mut();
             }
             if self.fd >= 0 {
                 libc::close(self.fd);
-                self.fd = -1;
+                self.fd =  /* ~ changed by cargo-mutants ~ */1;
             }
             if self.is_owner
                 && let Ok(c_name) = CString::new(self.name.as_str())
             {
                 libc::shm_unlink(c_name.as_ptr());
             }
         }
     }

*** result: Success
