*** crates/idle-ipc/src/shm.rs:30:12: delete ! in SharedMemory::create

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ delete ! in SharedMemory::create
@@ -22,17 +22,17 @@
 
 // SAFETY: `SharedMemory` is the exclusive owner of the fd and mapped pages.
 // Moving across threads transfers that ownership; concurrent access to the
 // mapping is a protocol concern (single writer per field), not a Send concern.
 unsafe impl Send for SharedMemory {}
 
 impl SharedMemory {
     pub fn create(name: &str, size: usize) -> Result<Self, String> {
-        if !is_valid_shm_name(name) {
+        if  /* ~ changed by cargo-mutants ~ */is_valid_shm_name(name) {
             return Err(format!("invalid shm name: {name}"));
         }
         if size < std::mem::size_of::<SharedMemoryHeader>() || size > 64 * 1024 * 1024 {
             return Err(format!("shm size out of range: {size}"));
         }
         let c_name = CString::new(name).map_err(|e| e.to_string())?;
 
         // Named POSIX SHM only: the IPC child re-opens by name (`SharedMemory::open`).

---- shm::tests::cells_mut_rejects_bad_magic stdout ----

thread 'shm::tests::cells_mut_rejects_bad_magic' (1565394) panicked at crates/idle-ipc/src/shm_tests.rs:103:70:
create: "invalid shm name: /trance-shm-test-magic-0"

---- shm::tests::cells_mut_accepts_zero_or_correct_magic stdout ----

thread 'shm::tests::cells_mut_accepts_zero_or_correct_magic' (1565393) panicked at crates/idle-ipc/src/shm_tests.rs:117:73:
create: "invalid shm name: /trance-shm-test-magic-ok-0"

---- shm::tests::cells_mut_rejects_dims_exceeding_map stdout ----

thread 'shm::tests::cells_mut_rejects_dims_exceeding_map' (1565395) panicked at crates/idle-ipc/src/shm_tests.rs:135:69:
create: "invalid shm name: /trance-shm-test-dims-0"

failures:
    shm::tests::cells_mut_accepts_zero_or_correct_magic
    shm::tests::cells_mut_rejects_bad_magic
    shm::tests::cells_mut_rejects_dims_exceeding_map
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name
    shm::tests::create_rejects_bad_name
    shm::tests::create_rejects_tiny_size

test result: FAILED. 25 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
