*** crates/idle-ipc/src/shm.rs:33:69: replace > with < in SharedMemory::create

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace > with < in SharedMemory::create
@@ -25,17 +25,17 @@
 // mapping is a protocol concern (single writer per field), not a Send concern.
 unsafe impl Send for SharedMemory {}
 
 impl SharedMemory {
     pub fn create(name: &str, size: usize) -> Result<Self, String> {
         if !is_valid_shm_name(name) {
             return Err(format!("invalid shm name: {name}"));
         }
-        if size < std::mem::size_of::<SharedMemoryHeader>() || size > 64 * 1024 * 1024 {
+        if size < std::mem::size_of::<SharedMemoryHeader>() || size < /* ~ changed by cargo-mutants ~ */ 64 * 1024 * 1024 {
             return Err(format!("shm size out of range: {size}"));
         }
         let c_name = CString::new(name).map_err(|e| e.to_string())?;
 
         // Named POSIX SHM only: the IPC child re-opens by name (`SharedMemory::open`).
         // O_EXCL + 0600: refuse squatters and keep the object owner-private.
         // SAFETY: `c_name` is a valid CString; unlink best-effort for stale objects.
         unsafe {

---- shm::tests::cells_mut_accepts_zero_or_correct_magic stdout ----

thread 'shm::tests::cells_mut_accepts_zero_or_correct_magic' (1566921) panicked at crates/idle-ipc/src/shm_tests.rs:117:73:
create: "shm size out of range: 96"

---- shm::tests::cells_mut_rejects_bad_magic stdout ----

thread 'shm::tests::cells_mut_rejects_bad_magic' (1566922) panicked at crates/idle-ipc/src/shm_tests.rs:103:70:
create: "shm size out of range: 120"

---- shm::tests::create_open_roundtrip_name stdout ----

thread 'shm::tests::create_open_roundtrip_name' (1566925) panicked at crates/idle-ipc/src/shm_tests.rs:153:50:
create: "shm size out of range: 120"

failures:
    shm::tests::cells_mut_accepts_zero_or_correct_magic
    shm::tests::cells_mut_rejects_bad_magic
    shm::tests::cells_mut_rejects_dims_exceeding_map
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name
    shm::tests::create_rejects_oversized

test result: FAILED. 26 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
