*** crates/idle-ipc/src/shm.rs:48:31: replace | with ^ in SharedMemory::create

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace | with ^ in SharedMemory::create
@@ -40,17 +40,17 @@
         // SAFETY: `c_name` is a valid CString; unlink best-effort for stale objects.
         unsafe {
             libc::shm_unlink(c_name.as_ptr());
         }
         // SAFETY: O_CREAT|O_EXCL|O_RDWR with mode 0600 on a validated name.
         let fd = unsafe {
             libc::shm_open(
                 c_name.as_ptr(),
-                libc::O_CREAT | libc::O_RDWR | libc::O_EXCL,
+                libc::O_CREAT ^ /* ~ changed by cargo-mutants ~ */ libc::O_RDWR | libc::O_EXCL,
                 0o600,
             )
         };
         if fd < 0 {
             return Err(format!(
                 "shm_open (create) failed: {}",
                 std::io::Error::last_os_error()
             ));

*** result: Success
