*** crates/idle-ipc/src/shm.rs:60:64: replace < with <= in SharedMemory::create

*** mutation diff:
--- crates/idle-ipc/src/shm.rs
+++ replace < with <= in SharedMemory::create
@@ -52,17 +52,17 @@
         if fd < 0 {
             return Err(format!(
                 "shm_open (create) failed: {}",
                 std::io::Error::last_os_error()
             ));
         }
 
         // SAFETY: `fd` is open; size fits in off_t (capped at 64 MiB above).
-        if unsafe { libc::ftruncate(fd, size as libc::off_t) } < 0 {
+        if unsafe { libc::ftruncate(fd, size as libc::off_t) } <= /* ~ changed by cargo-mutants ~ */ 0 {
             let err = std::io::Error::last_os_error();
             // SAFETY: clean up partially created object on size failure.
             unsafe {
                 libc::close(fd);
                 libc::shm_unlink(c_name.as_ptr());
             }
             return Err(format!("ftruncate failed: {err}"));
         }

---- shm::tests::cells_mut_rejects_bad_magic stdout ----

thread 'shm::tests::cells_mut_rejects_bad_magic' (1570534) panicked at crates/idle-ipc/src/shm_tests.rs:103:70:
create: "ftruncate failed: No such file or directory (os error 2)"

---- shm::tests::cells_mut_accepts_zero_or_correct_magic stdout ----

thread 'shm::tests::cells_mut_accepts_zero_or_correct_magic' (1570533) panicked at crates/idle-ipc/src/shm_tests.rs:117:73:
create: "ftruncate failed: No such file or directory (os error 2)"

---- shm::tests::cells_mut_rejects_dims_exceeding_map stdout ----

thread 'shm::tests::cells_mut_rejects_dims_exceeding_map' (1570535) panicked at crates/idle-ipc/src/shm_tests.rs:135:69:
create: "ftruncate failed: No such file or directory (os error 2)"

failures:
    shm::tests::cells_mut_accepts_zero_or_correct_magic
    shm::tests::cells_mut_rejects_bad_magic
    shm::tests::cells_mut_rejects_dims_exceeding_map
    shm::tests::create_accepts_header_mid_and_max_sizes
    shm::tests::create_open_roundtrip_name

test result: FAILED. 27 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
